title: Duo Security Admin Login from Unusual Location
id: 5d463be4-il7p-4o4l-mp0o-5n9p1q3o4p5n
status: stable
description: |
    Detects administrator logins to the Duo Admin Panel. Admin panel access
    should be monitored as compromise could allow attackers to disable MFA
    across the organization.
references:
    - https://duo.com/docs/adminapi#administrator-logs
author: Mantissa Security Team
date: 2025-01-28
tags:
    - attack.initial_access
    - attack.t1078.004
    - attack.persistence
logsource:
    product: cisco
    service: duo
detection:
    selection:
        action: admin_login
    condition: selection
falsepositives:
    - Legitimate administrator access
level: low
