title: New Okta User Created
id: b6c718dd-8f53-4b9f-98d8-93fdca966969
status: test
description: Detects new user account creation
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-10-25
references:
    - https://developer.okta.com/docs/reference/api/event-types/
tags:
    - attack.credential-access
logsource:
    service: system
    product: okta
detection:
    selection:
        event.action: 'user.lifecycle.create'
    condition: selection
falsepositives:
    - Legitimate and authorized user creation
level: informational
